Experiencing some issues with error:

```
│ Error: error creating ruleset artists: HTTP status 400: rewrite action parameters are required for the rewrite action
```

Reference module:
```
  # module.cloudflare.cloudflare_ruleset.static-rule["user-profiles"] will be created
  + resource "cloudflare_ruleset" "static-rule" {
      + description = "user-profiles"
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "user-profiles"
      + phase       = "http_request_transform"
      + zone_id     = "e93redactedfc0"

      + rules {
          + action      = "rewrite"
          + description = "URI transformation path example"
          + expression  = "(http.host eq \"user-profiles.example.com\")"
          + id          = (known after apply)
          + ref         = (known after apply)
          + version     = (known after apply)

          + action_parameters {

              + uri {
                  + path {
                      + expression = "concat(\"/file/example-prd-user-profiles\", http.request.uri.path)"
                    }
                }
            }
        }
    }
```
